LegendofKARTIS/kartx-ESP32-Fpv-rover-v1/ESP_Rover_v2_5/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static const char MAIN_page[] = R"rawliteral(

<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width,initial-scale=1">
    <style>
        body {
            margin: 0;
            background: #080808;
            color: #ffffff;
            font-family: Segoe UI, Arial, sans-serif;
        }

        .header {
            background: #101010;
            border-bottom: 2px solid #ffb000;
            padding: 12px;
            font-size: 28px;
            letter-spacing: 1px;
            font-weight: bold;
            font-family: Segoe UI, Arial, sans-serif;
            color: #ffb000;
            text-align: center;
        }

        .status {
            width: 700px;
            max-width: 95vw;
            margin: auto;
            display: flex;
            justify-content: space-evenly;
            background: #181818;
            border: 1px solid #444;
            border-radius: 8px;
            padding: 8px;
        }


        button {
            background: #222;
            color: white;
            border: 2px solid #ffb000;
            border-radius: 12px;
            width: 72px;
            height: 60px;
            font-size: 24px;
            transition: .15s;
        }

        button.active {
            background: #ffb000;
            color: #000;
            transform: scale(0.95);
            box-shadow: 0 0 18px #ffb000;
        }

        #cam {
            display: block;
            width: 96vw;
            max-width: 900px;
            aspect-ratio: 4/3;
            margin: 10px auto;
            border: 2px solid #ffb000;
            border-radius: 10px;
            object-fit: cover;
            background: #000;
        }

        .controls {
            width: 240px;
            margin: 20px auto;
            display: grid;
            grid-template-columns: 70px 70px 70px;
            grid-template-rows: 70px 70px 70px;
            gap: 10px;
            justify-items: center;
            align-items: center;
        }

        .controlPanel {
            width: 700px;
            max-width: 95vw;
            margin: 20px auto;

            display: flex;
            justify-content: center;
            align-items: center;
            gap: 60px;
        }


        .sliderBox span {
            display: block;
            text-align: center;
            font-size: 14px;
            margin-bottom: 6px;
            color: #ffb000;
        }


        .flashRow {
            display: flex;
            align-items: center;
            gap: 15px;
        }

        input[type=range] {
            width: 180px;
            accent-color: #ffb000;
        }

        .flashPanel {
            width: 320px;
            max-width: 95vw;
            margin: 18px auto;
            display: flex;
            align-items: center;
            gap: 12px;
        }

        #flash {
            width: 70px;
            height: 60px;
            flex-shrink: 0;
        }

        .sliderBox {
            flex: 1;
            display: flex;
            flex-direction: column;
        }

        .sliderLabel {
            font-size: 13px;
            color: #ffb000;
            margin-bottom: 4px;
            text-align: left;
        }

        #brightness {
            width: 100%;
        }
    </style>
</head>

<body>

    <div class="header">
        KartX FPV Rover <span style=" float:center; font-size:14px; color:#00ff66;">● ONLINE </span>
    </div>
    <div class="status">

        <span id="wifi">📶 --</span>

        <span id="fps">🎥 --</span>

        <span id="uptime">⏱ --</span>

    </div>
    <img id="cam">


    <!-- D-Pad -->
    <div class="controls">

        <div></div>
        <button id="forward">▲</button>
        <div></div>

        <button id="left">◀</button>
        <button id="stop">■</button>
        <button id="right">▶</button>

        <div></div>
        <button id="back">▼</button>
        <div></div>

