LegendofKARTIS/kartx-ESP32-Fpv-rover-v1/ESP_Rover_v2_5/app_httpd.cpp
    </div>

    <div class="flashPanel">

        <button id="flash">💡</button>

        <div class="sliderBox">

            <div class="sliderLabel">
                Brightness
            </div>

            <input id="brightness" type="range" min="0" max="255" value="180">

        </div>

    </div>


    <script>
        document.getElementById("cam").src =
            "http://" + location.hostname + ":81/stream";


        function send(cmd) {
            fetch("/" + cmd).catch(err => console.log(err));
        }
        function bind(id, cmd) {
            const b = document.getElementById(id);

            function start(e) {
                e.preventDefault();

                b.classList.add("active");

                send(cmd);
            }

            function stop(e) {
                e.preventDefault();

                b.classList.remove("active");

                send("stop");
            }

            b.addEventListener("mousedown", start);
            b.addEventListener("mouseup", stop);
            b.addEventListener("mouseleave", stop);

            b.addEventListener("touchstart", start, { passive: false });
            b.addEventListener("touchend", stop);
            b.addEventListener("touchcancel", stop);
        }

        bind("forward", "forward");
        bind("back", "back");
        bind("left", "left");
        bind("right", "right");

        document.getElementById("stop").onclick = () => {
            send("stop");
        };
        const slider = document.getElementById("brightness");
        const brightValue = document.getElementById("brightValue");

        slider.oninput = function () {
            fetch("/brightness?val=" + this.value);
        };
        const flash = document.getElementById("flash");

        flash.onclick = function () {
            flash.classList.toggle("active");
            fetch("/flash");
        };

        async function updateStats() {
            try {
                const res = await fetch("/status");
                const data = await res.json();

                let wifiText = "";
                let wifiIcon = "";

                if (data.rssi >= -55) {
                    wifiText = "Excellent";
                    wifiIcon = "📶";
                }
                else if (data.rssi >= -67) {
                    wifiText = "Good";
                    wifiIcon = "📶";
                }
                else if (data.rssi >= -75) {
                    wifiText = "Fair";
                    wifiIcon = "📶";
                }
                else if (data.rssi >= -85) {
                    wifiText = "Weak";
                    wifiIcon = "📶";
                }
                else {
                    wifiText = "Very Weak";
                    wifiIcon = "❌";
                }

                document.getElementById("wifi").innerHTML =
                    wifiIcon + " " + wifiText + " (" + data.rssi + " dBm)";

                document.getElementById("fps").innerHTML =
                    "🎥 " + data.fps + " FPS";

                document.getElementById("uptime").innerHTML =
                    "⏱ " + data.uptime;
            }
            catch (e) {
                console.log(e);
            }
        }

        setInterval(updateStats, 1000);

        updateStats();

    </script>

</body>

</html>

  )rawliteral";


static esp_err_t forward_handler(httpd_req_t *req) {
  forwardMotor();
  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t backward_handler(httpd_req_t *req) {
  backwardMotor();
  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t left_handler(httpd_req_t *req) {
  leftMotor();
  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t right_handler(httpd_req_t *req) {
  rightMotor();
  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t stop_handler(httpd_req_t *req) {
  stopMotor();
  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t flash_handler(httpd_req_t *req) {
  flashState = !flashState;

  ledcWrite(FLASH_LED_PIN, flashState ? led_duty : 0);

  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t brightness_handler(httpd_req_t *req) {
  char *buf = NULL;
  char value[8];

  if (parse_get(req, &buf) != ESP_OK)
    return ESP_FAIL;

  if (httpd_query_key_value(buf, "val", value, sizeof(value)) == ESP_OK) {
    led_duty = atoi(value);

    if (flashState)
      ledcWrite(FLASH_LED_PIN, led_duty);
  }

  free(buf);

  return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}


static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, MAIN_page, HTTPD_RESP_USE_STRLEN);
}



void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 24;

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

